In [1]:
import pandas as pd

In [2]:
data_set = pd.read_csv('data/Data.csv')
data_set

,country,year,uniqueid,bank_account,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
0,Kenya,2018,uniqueid_1,Yes,Rural,Yes,3,24,Female,Spouse,Married/Living together,Secondary education,Self employed
1,Kenya,2018,uniqueid_2,No,Rural,No,5,70,Female,Head of Household,Widowed,No formal education,Government Dependent
2,Kenya,2018,uniqueid_3,Yes,Urban,Yes,5,26,Male,Other relative,Single/Never Married,Vocational/Specialised training,Self employed
3,Kenya,2018,uniqueid_4,No,Rural,Yes,5,34,Female,Head of Household,Married/Living together,Primary education,Formally employed Private
4,Kenya,2018,uniqueid_5,No,Urban,No,8,26,Male,Child,Single/Never Married,Primary education,Informally employed
...,...,...,...,...,...,...,...,...,...,...,...,...,...
23519,Uganda,2018,uniqueid_2113,No,Rural,Yes,4,48,Female,Head of Household,Divorced/Seperated,No formal education,Other Income
23520,Uganda,2018,uniqueid_2114,No,Rural,Yes,2,27,Female,Head of Household,Single/Never Married,Secondary education,Other Income
23521,Uganda,2018,uniqueid_2115,No,Rural,Yes,5,27,Female,Parent,Widowed,Primary education,Other Income
23522,Uganda,2018,uniqueid_2116,No,Urban,Yes,7,30,Female,Parent,Divorced/Seperated,Secondary education,Self employed
23523,Uganda,2018,uniqueid_2117,No,Rural,Yes,10,20,Male,Child,Single/Never Married,Secondary education,No Income

In [3]:
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23524 entries, 0 to 23523
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   country                 23524 non-null  object
 1   year                    23524 non-null  int64
 2   uniqueid                23524 non-null  object
 3   bank_account            23524 non-null  object
 4   location_type           23524 non-null  object
 5   cellphone_access        23524 non-null  object
 6   household_size          23524 non-null  int64
 7   age_of_respondent       23524 non-null  int64
 8   gender_of_respondent    23524 non-null  object
 9   relationship_with_head  23524 non-null  object
 10  marital_status          23524 non-null  object
 11  education_level         23524 non-null  object
 12  job_type                23524 non-null  object
dtypes: int64(3), object(10)
memory usage: 2.3+ MB

In [4]:
data_set.describe()

               year  household_size  age_of_respondent
count  23524.000000    23524.000000       23524.000000
mean    2016.975939        3.797483          38.805220
std        0.847371        2.227613          16.520569
min     2016.000000        1.000000          16.000000
25%     2016.000000        2.000000          26.000000
50%     2017.000000        3.000000          35.000000
75%     2018.000000        5.000000          49.000000
max     2018.000000       21.000000         100.000000

In [5]:
data_set.shape

(23524, 13)

In [7]:
data_set.isnull().sum()

country                   0
year                      0
uniqueid                  0
bank_account              0
location_type             0
cellphone_access          0
household_size            0
age_of_respondent         0
gender_of_respondent      0
relationship_with_head    0
marital_status            0
education_level           0
job_type                  0
dtype: int64

In [8]:
check_duplicate = data_set.duplicated()
check_duplicate.sum()

0

In [9]:
uniqueid_duplicates = data_set['uniqueid'].duplicated()
uniqueid_duplicates.sum()

14789

In [10]:
data_set.shape

(23524, 13)

In [11]:
clean_data = data_set.drop_duplicates(subset=['uniqueid'])
clean_data

,country,year,uniqueid,bank_account,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
0,Kenya,2018,uniqueid_1,Yes,Rural,Yes,3,24,Female,Spouse,Married/Living together,Secondary education,Self employed
1,Kenya,2018,uniqueid_2,No,Rural,No,5,70,Female,Head of Household,Widowed,No formal education,Government Dependent
2,Kenya,2018,uniqueid_3,Yes,Urban,Yes,5,26,Male,Other relative,Single/Never Married,Vocational/Specialised training,Self employed
3,Kenya,2018,uniqueid_4,No,Rural,Yes,5,34,Female,Head of Household,Married/Living together,Primary education,Formally employed Private
4,Kenya,2018,uniqueid_5,No,Urban,No,8,26,Male,Child,Single/Never Married,Primary education,Informally employed
...,...,...,...,...,...,...,...,...,...,...,...,...,...
14798,Rwanda,2016,uniqueid_8755,No,Rural,Yes,5,31,Female,Spouse,Married/Living together,Primary education,Farming and Fishing
14799,Rwanda,2016,uniqueid_8756,No,Rural,No,6,49,Female,Spouse,Married/Living together,No formal education,Remittance Dependent
14800,Rwanda,2016,uniqueid_8757,No,Rural,Yes,6,42,Female,Spouse,Married/Living together,Primary education,Farming and Fishing
14801,Rwanda,2016,uniqueid_8758,No,Rural,Yes,6,65,Male,Head of Household,Married/Living together,Primary education,Informally employed
14802,Rwanda,2016,uniqueid_8759,No,Rural,Yes,6,31,Male,Head of Household,Married/Living together,No formal education,Farming and Fishing

In [12]:
data_set.shape

(23524, 13)

## Analyzing Total Number of People Accord to Country, Gender, Marital status, Location, Bank Account, Job Type, Education level and Telephone Access

In [13]:
all_country = data_set['country'].unique().tolist()
for x in all_country:
    print(f"{x} = {data_set['country'].value_counts()[x]}")
print("")    
print('*'*46)  
bank_account = data_set['bank_account'].unique().tolist()
print("People With Bank Account")
for x in bank_account:
    print(f"{x} = {data_set['bank_account'].value_counts()[x]}")
    
print("")   
print('*'*46)  
print('Gender')
gender = data_set['gender_of_respondent'].unique().tolist()
for x in gender:
    print(f"{x} = {data_set['gender_of_respondent'].value_counts()[x]}")
    
print("") 
print("*"*46)  
print("Marital Status")
marital = data_set['marital_status'].unique().tolist()
for x in marital:
    print(f"{x} = {data_set['marital_status'].value_counts()[x]}")
    
print("") 
print("*"*46)  
print("Cellphone Access")
phones = data_set['cellphone_access'].unique().tolist()
for x in phones:
    print(f"{x} = {data_set['cellphone_access'].value_counts()[x]}")    
    
print("") 
print("*"*46)  
print("Location Type")
location = data_set['location_type'].unique().tolist()
for x in location:
    print(f"{x} = {data_set['location_type'].value_counts()[x]}")    
    
print("") 
print("*"*46)  
print("Education Level")
education = data_set['education_level'].unique().tolist()
for x in education:
    print(f"{x} = {data_set['education_level'].value_counts()[x]}")  
    

print("") 
print("*"*46)  
print("Job Type")
job = data_set['job_type'].unique().tolist()
for x in job:
    print(f"{x} = {data_set['job_type'].value_counts()[x]}")

Kenya = 6068
Rwanda = 8735
Tanzania = 6620
Uganda = 2101

**********************************************
People With Bank Account
Yes = 3312
No = 20212

**********************************************
Gender
Female = 13877
Male = 9647

**********************************************
Marital Status
Married/Living together = 10749
Widowed = 2708
Single/Never Married = 7983
Divorced/Seperated = 2076
Dont know = 8

**********************************************
Cellphone Access
Yes = 17454
No = 6070

**********************************************
Location Type
Rural = 14343
Urban = 9181

**********************************************
Education Level
Secondary education = 4223
No formal education = 4515
Vocational/Specialised training = 803
Primary education = 12791
Tertiary education = 1157
Other/Dont know/RTA = 35

**********************************************
Job Type
Self employed = 6437
Government Dependent = 247
Formally employed Private = 1055
Informally employed = 5597
Formally employed Government = 387
Farming and Fishing = 5441
Remittance Dependent = 2527
Other Income = 1080
Dont Know/Refuse to answer = 126
No Income = 627

In [14]:
aggregated_data = data_set.groupby('age_of_respondent').agg({'marital_status':'count'})
aggregated_data

                   marital_status
age_of_respondent
16                            462
17                            477
18                            585
19                            470
20                            626
...                           ...
96                              3
97                              1
98                              6
99                              2
100                             5

[85 rows x 1 columns]

In [15]:
data_set['range_of_household'] = pd.cut(data_set['household_size'], bins=3, labels=['low', 'medium', 'high']) 
columns = ['household_size','range_of_household']
data_set[columns].tail(-10)

       household_size range_of_household
10                  5                low
11                  3                low
12                  6                low
13                  8             medium
14                  4                low
...               ...                ...
23519               4                low
23520               2                low
23521               5                low
23522               7                low
23523              10             medium

[23514 rows x 2 columns]

In [16]:
data_set.shape

(23524, 14)

In [17]:
import numpy as np

In [20]:
data = np.where(data_set['marital_status']== 'Single/Never Married' )
data2 = np.where(data_set['age_of_respondent'] < 18)
data

(array([    2,     4,    18, ..., 23518, 23520, 23523]),)

In [19]:
len(data[0])

7983